<template>
    <div>
        <b>Всем привет! </b>
        <p>
            Меня зовут Илона Божé, я закончила первый курс <a href="https://vk.com/ct_ifmo">КТ ИТМО</a> и сейчас
            стажируюсь в Google Zurich на программе STEP.
            В этой статье я хочу рассказать о программе STEP как таковой и отборе, который я прошла, прежде чем попасть
            на неё. В целом, стажировка не сильно отличается от классической, так что может быть полезно и тем, кто
            хочет просто узнать об отборе на стажировку в Google :)<br>
            Тем, кому интересно почитать про классическую стажировку и заграничные стажировки в принципе, могу
            порекомендовать <a href="https://habr.com/ru/company/hsespb/blog/432912/">статью Юрия Ребрика</a>.
        </p>
        <h2>Summer Trainee Engineering Program</h2>
        <p>
            STEP — это программа, предназначенная для студентов, окончивших первый или второй курс бакалавриата по
            Computer Science или смежным специальностям. Стажировка проходит летом, начинается 1 июля и длится 12
            недель. Цель программы — познакомить студентов с нюансами промышленной разработки и вдохновить на
            продолжение работы в этой области.
        </p>
        <p>
            Одним из ключевых отличий STEP от обычной стажировки является то, что вы будете работать над проектом не в
            одиночку, а в паре с другим STEP-стажером. Насколько много вы будете с ним взаимодействовать, зависит от
            проекта и от того, как ваши хосты решат разделить работу между вами. Например, я почти не обсуждаю проект со
            своей партнершей, потому что мы работаем с разными технологиями и пишем под разные платформы, а кто-то из
            моих друзей наоборот тесно взаимодействуют со своими партнерами и пишут очень близкие вещи. В общем, team
            dependent.
        </p>
        <p>
            Наблюдение: исторически сложилось, что на STEP охотнее берут девушек. Например, сейчас из ИТМО на STEP
            стажируются три девушки и один парень, и такое соотношение вроде как наблюдается среди всех STEP-стажёров
            Европы. Стоит учитывать, что на сайте стажировки написано, что она предназначена в основном для минорити в
            IT, для девушек, например.
        </p>
        <h2>Enjoy your internship</h2>
        <p>
            Google старается сделать стажировку не только очень полезной, но и как можно более приятной и комфортной для
            новичков. В компании очень дружелюбная атмосфера, люди вокруг очень приветливые и всегда рады поговорить или
            что-то подсказать.
        </p>
        <p>
            Есть несколько человек, которые будут поддерживать вас во время стажировки. По всем вопросам, связанным с
            проектом, можно и нужно обращаться к своим хосту и ко-хосту, а также к тиммейтам, которые обычно очень рады
            помочь. Организационными вопросами занимаются HR, с которыми вы познакомитесь ещё во время подачи и
            прохождения интервью, во время стажировки они разбираются со всем, что связано с разными тренингами и
            мероприятиями. Ну и наконец, у каждого STEP-интерна обязательно есть ментор, который назначается в первые
            пару недель стажировки. Ментор — это фуллтаймер из команды, максимально далёкой от вашей, и скорее всего не
            знакомый ни с кем из тех, с кем вы работаете. С ним не выйдет говорить о проекте, но можно обсуждать
            возникающие вопросы, просить рассказать про гугл, познакомить с кем-нибудь, показать какие-нибудь клёвые
            места.
        </p>
        <p>
            В Google не принято работать по ночам и по выходным, так что, хоть такое желание и может возникнуть, лучше
            всё-таки потратить свободное время на отдых и путешествия. В офисах есть множество классных мест, где можно
            посидеть с друзьями, поиграть в настолки / бильярд / кикер / видеоигры, выпить кофе и съесть шоколадку на
            одной из множества микрокухонь, поспать в sleeping room, сходить на танцевальный курс или в спортзал. На
            выходных стажёры чаще всего куда-нибудь уезжают: в Европе всё очень близко, и поэтому пока есть возможность
            и шенген, можно побывать во всех соседних странах. В некоторых из них еще и есть другие офисы Google, на
            которые бывает интересно посмотреть, или проходят какие-то крутые мероприятия.
        </p>
        <img src="https://lh3.googleusercontent.com/OXU45hYl_k-STmaC4QzbfTJ7kwwUKu8pjIFmuN_QtxMiMXMRaUNewyWz9O8v94i9aYPtP5mjr940ZoQSeNMS-ryWM46cwgdzI1H3GEwAD5x4VH_fJjDCDDR_T1wEkkVvxdStOvGT1eGjBm4tp5jno4bdtf-lYn3-KsEU9IpW1jZEnRxvgGpcmVHcedghgDT0xR7NrCbVzODMPsjFHY301Z3VU0tfzlL7hIq_OEei5lHmJio6eQnje2uxmZ_a2QQ2WjPy9cv3geYFZklQavsIsKfvQGXiqS_Dmhy269ouD9DAKUYI6OB-0dl_1Q6K29nz6021aWcHr3lo5LCf-5zBtsrPT9onHs9UY4SDIpZdmQ5rUl17CzUMwKXTxdIl3fqzjiRBVqJ9r72jQ5nbEHciYCVD7KqiON2aaVCLHmC7GE-XVGn5M7RsrtoVsiVX-XiW0WQ8khucPsdlt--t4K64-JQz_Do9MZRP4eLRuhj69wsWUnGazileARDZz1voF90ioN9kQvbSKBKhkPfWhU7FwVWDcumoOFzyTxxfGlDnijFqRJLCsJC21oUDxCxQxEZ9YvMl6Dl378QTkUsCLJD6Cm3PUNtLZJJAwTib0G6jGbbUZzMlmT6TIGPwKkWXbtqp1cu9mwNBfrySvkzojdWTIG3szDBj-pe0CvdWLpOtJOXD8vOJXipaCsjws5OsBEhY06m0mf5X5i_ooODdER3m9g3lZu4g7Uf1RRq5RnW6E01vqv8QaQXu-dg=w1279-h705-no"
             alt="Cute Google cakes on STEP Orientation">
        <h2>How to get there?</h2>
        <p>
            Чтобы попасть на стажировку в Google, надо сначала подать заявку. Подача заявок открывается в конце
            сентября, и чем раньше вы подадитесь, тем больше у вас шанс пройти. Подаваться лучше всего через своего
            знакомого, который работает в Google на fulltime, потому что так опять же шансы пройти на следующий этап
            сильно выше. Это могут быть ваши друзья из ЛКШ, знакомые из ВУЗа или знакомые ваших друзей :) Не стесняйтесь
            просить, гуглеры обычно классные приветливые ребята и с радостью вам помогут.
        </p>

        <p>Процесс отбора:</p>>
        <ol>
            <li>Подача резюме через гугл-фуллтаймера.</li>
            <li>Выбор вакансий на <a href="https://careers.google.com/students/">careers.google.com</a>. Выбрать можно
                три вакансии. Вакансии на STEP делятся по блокам городов, советую подать на все доступные блоки в
                Европе, потому что в США действует отдельное ограничение, по которому требуется учиться в Северной
                Америке.
            </li>
            <li>Два технических интервью. Каждое интервью длится 45 минут, между ними перерыв 15 минут, каждое проводит
                интервьюер из Google.
            </li>
            <li>Host matching. Процесс выбора проектов, ряд собеседований, на которых потенциальные хосты смотрят на вас
                и рассказывают про проект, вы смотрите на потенциальных хостов и рассказываете про себя, а потом либо
                выбираете друг друга, либо продолжаете поиск.
            </li>
            <li>Получение оффера и подписание контракта.</li>
        </ol>
        <p>На каждом из этих этапов вы можете получить грустное письмо о том, что гугл решил не продолжать процесс
            отбора на этот раз, но лучше податься и получить такое письмо, чем не подаваться вообще. Для тех, кто не
            прошел в этом году, есть бонусы при подаче в следующем.<br>
            Также может помочь <a href="https://vk.com/internship_it">группа VK</a> и <a
                    href="https://t.me/sns_internships">telegram-чатик @sns_internships</a>, в которой можно найти
            множество полезных материалов и советов, а также ссылку
            на telegram-чатик.
        </p>
        <h2>CV / resume </h2>
        <p>Несколько правил, которые я усвоила, пока писала своё резюме на STEP: </p>
        <ul>
            <li>Должно быть размером не более одного листа А4 и иметь нормальное название, например, Alexander Hamilton
                CV.pdf
            </li>
            <li>Лучше всего выглядит в pdf формате, натехать можно самостоятельно или с помощью какого-нибудь классного
                шаблона с <a href="overleaf.com">overleaf.com</a>.
            </li>
            <li>
                Структура:
                <ol>
                    <li>Имя, телефон, почта.</li>
                    <li>Образование (только ВУЗ и образовательная программа, например, Computer Science или Programming
                        Engineering, школу писать не нужно).
                    </li>
                    <li>Опыт. Тут могут быть предыдущие места работы по специальности (если они есть) и личные проекты.
                        Если своих личных проектов нет (хотя лучше бы они были) подумайте, какие большие домашки вы уже
                        делали, их можно будет упомянуть. К каждому проекту было бы неплохо написать, какие технологии
                        использовались при его написании, и в идеале приложить ссылку на код на <a href="github.com">github.com</a>.
                    </li>
                    <li>Технологии, языки программирования которыми владеете.</li>
                    <li>Competitive programming. Ещё один способ рассказать о себе, когда у вас мало опыта и проектов.
                        Учтите, что рекрутеры скорее всего ничего не знают ни о Всеросе, ни о ВКОШПе, так что наиболее
                        правильным кажется вариант а-ля \"I / my team got into Q qualified out of N from all over
                        Russia\".
                    </li>
                    <li>Можно добавить ещё что-нибудь про летние программистские / математические школы и пройденные
                        курсы в университете.
                    </li>
                </ol>
            </li>
            <li>Полезный док: <a
                    href="https://careers.twitter.com/content/dam/careers-twitter/university/2018_Resume101.pdf">Twitter
                Resume 101</a>.
            </li>
            <li>Полезная статья от человека, который просмотрел несколько сотен прогерских резюме: <a
                    href="https://drive.google.com/file/d/10b9NZDhPbUOW_C7108IKe9ev6Ed2UG7F/view">Resume Workshop</a>.
            </li>
            <li>Когда напишете резюме, дайте его прочитать своему реферу или просто другу, который уже ездил на
                стажировки в эту компанию, скорее всего, вам дадут несколько ценных советов.
            </li>
        </ul>
        <p>Мне в своё время тоже много помогали, за что всем большое спасибо :)</p>
        <h2>Technical interviews</h2>
        <p>Очень полезная книжка: Cracking the Coding Interview.</p>
        <p>Всего два интервью, в исключительном случае могут попросить пройти третье. Оба интервью проходят в один день,
            каждое длится 45 минут, перерыв между ними 15 минут. Каждое из интервью проводит Google-фуллтаймер, разные
            интервью проводят разные люди. Созвон происходит с помощью <a
                    href="http://hangouts.google.com/">hangouts</a>, весь код пишется в специально созданный
            для этого <a href="https://docs.google.com/document/u/0/?tgif=d">google doc</a>. Золотое правило: после
            первого интервью, каким бы оно ни было — успешным или
            провальным — забудьте про него и начинайте второе с чистой головой.</p>
        <p>По итогу ваш интервьюер досконально описывает ваше поведение во время интервью и ставит какие-то оценки, так
            что очень важно, чтобы в каждый момент времени он понимал, чем вы сейчас заняты. Думаете над задачей —
            делайте это вслух, не пытайтесь сразу придумать идеальное решение, начните с более простых или
            асимптотически не оптимальных вариантов, потом всегда можно попытаться додумать. </p>
        <p>Интервью проводится на английском, что может стать большим испытанием, но на самом деле сильно высокий
            уровень английского не нужен, главное, чтобы вы смогли понять, чего от вас хотят, и донести, что хотите
            сделать. Не стесняйтесь переспрашивать или просить написать какие-то ключевые моменты в пошаренный гугл док,
            в котором вы будете кодить и который будет доступен вам и вашему интервьюеру. <br>
            Код пишется в гугл доке, что может вызвать дополнительные неудобства, открыть любимую среду разработки с
            автодополнением и шаблонами не выйдет. Поучитесь писать код в таких условиях.</p>
        <p>
            Хорошей практикой считается пройти одно-два mock-interview (пробных интервью) с более опытными друзьями или
            на специальных сервисах, например на <a href="https://www.pramp.com/">pramp.com</a>.<br>
            Задачи на интервью отличаются от обычных олимпиадных тем, что должны решаться и кодиться за довольно
            ограниченное время и редко содержат какие-то сложные структуры данных, так что полезно порешать подобные
            задачи на сервисах вроде <a href="https://leetcode.com/">leetcode.com</a>. Часто бывает, что вы решаете
            задачу на интервью, остается время, и
            интервьюер решает дать вам усложненную модификацию.
        </p>
        <p>На STEP обычно очень простые задачи на отборе (в основном на несложные темы а-ля списки, массивы, бинарные
            деревья поиска (несбалансированные), стеки и очереди, динамика, бинарный поиск, etc.), так что самое важное
            — не волноваться и внимательно слушать то, что говорит вам интервьюер. </p>
        <p>Результаты технического интервью обрабатываются от пары недель до пары месяцев, волноваться раньше времени не
            нужно: в случае отказа вам тоже напишут. По результатам технического интервью могут предложить сконвертиться
            со STEP-стажёра на обычного и матчиться уже как обычный. Некоторые мои друзья так и сделали, я решила
            остаться на STEP, потому что понимала, что для обычной стажировки мне сильно не хватает опыта и мои шансы
            сматчиться существенно упадут. В итоге считаю, что это было очень правильным решением. </p>
        <img src="https://lh3.googleusercontent.com/TAnm9AfLsO5cNsnQUiMvIxdfni2nxwRy4eo2UTo5SiA9SFJLx_n0svv9CLS1sJ9qlG4wLun3WRbSX-gMeTcXvzSS6qvODxc_NJT7Q7RCepW5VZ2JtwVHjEDZIIpvFnpkLJtIN33h12wZvfrOrg3v4JVcc1tNzDQZkCszEAkiJQK2b9NhphUKS9JHXuctQGO1quvMpyHmn8dXSRjuG5s2b3n5AFZBRwxVAi2XedtyTv6GOo0X9-ZhUaqj8GLo26W_x9CyBDQNu1m4lBdveOcKI1lkkD94yTYwh-5LhFBObP4HHvOeN0HuX0Go0JOxHnbqNxEpISBR9wtdII1vAuVzSU6BfiyGztVUSZQ_11VXeNbA0CkBrLYWzxHl9Z6vEZEL-bsDubZNGuNgMw7tTLeWbFvZt3a-GPCJlm6mlMva3iGRRMQJoyWx5b5jx64YFVTOGmfGXCKmsjVYpTLoaz3rAgffcUs9a_kZhVEJsMMrj4vLu0jXl_QLc8ikJp6_ZRFUB8ETcXCA4d2DW5zow_Nc18iFV36BxAGc7_5TvjWuXwrikS71f2xfPeyPthoY8iAxiKN773Xttv3FELX4oT98JFn0RmxpkWJd9lkOyZU0dn_pCxnpFT_4XMTQSaZncJwDpczMEx0N400enA5_CjhMq4w8Sdv2os_VIg_xTiOJO2G-EIjgjADCCa2BebpK9JaDWsdg_pTf7a00oe3fRxSG3qgQAGydKohNO84c_eVGVaz0QkpJo7Jbv0w=w706-h288-no"
             alt="Google Zurich office">
        <h2>Host-matching</h2>
        <p>После того, как вы получите письмо об успешном прохождении технических интервью и поболтаете по hangouts со
            своим HR’ом, начнётся пора хост-матчингов. Время от времени рекрутер будет назначать созвон с какой-нибудь
            командой. </p>
        <p>Во время этого созвона вы будете общаться с потенциальными хостами, они расскажут про себя и про проект,
            которым вам предлагается заниматься в течение стажировки, и поспрашивают про вас, ваш опыт в разработке и в
            командной работе в целом. Полезно иметь небольшой заготовленный рассказ о себе и уметь быстро и живо его
            проговаривать.</p>
        <p>По результатам хост-матчинга вы пишете рекрутеру, хотите ли вы работать с этой командой или нет, и команда
            пишет, хочет ли она работать с вами. Если вы оба согласны — матчинг произошёл, добро пожаловать в
            команду! </p>
        <p>Во время разговора проявляйте интерес к проекту, задавайте вопросы и просто будьте дружелюбным, тогда проблем
            с матчингом на понравившийся проект не возникнет :) </p>
        <h2>What comes next?</h2>
        <p>Спустя некоторое время к вам на подпись придёт контракт. Если вас всё устроит, вы подпишите его и всё, летняя
            стажировка официально подтверждена.</p>
        <p>Дальше будут много дел с визами, поиском жилья, etc. Google возмещает все затраты, связанные с получением
            визы. Жильё стажёрам не предоставляется, однако компания даёт достаточно денег, чтобы найти и снять его
            самостоятельно.</p>
        <h2>Thank you for attention! </h2>
        <p>Спасибо за прочтение и успешной вам карьеры!</p>
        <p>Если вы увидели какую-либо неточность, пожалуйста, сообщите <a href="https://vk.com/ilonabozhe">мне</a>.</p>
        <img src="https://lh3.googleusercontent.com/ZvemBbhMVj8zOwgSiRz9YZi_B03M44zBQe7AAajm5e_N6m-b16f28KJzS4VYZqPi91LscXwU2tIhfJ3m7YDpLaZJao74Hg87YPjLuEr5SsuvMl4Uh78_RO6HB2cPnr8QFgb9HUZET0QMC18O1yeGrY7TYNY96Au63qRiKaenmd7tMGJwaRdJZQ0H28rx822fgWJgdrNuAbPeBzzWh454SXiB7Ls_MZ3rvnSmlT8zs5BxM8Zxf4vqLfnRjrZMJXHv-OHarvmBvPUbVbYiw20bhQT9YX-rAg5CXomqIKJ4G8vkc7ruqrg5jHMTqup_hdu1C7nQGYBCpCMRtUU95DVIAykVKCLnYIghDG9vxiooG898K7cR-0GZhrc-h5ycMtpCJIuqCOeQsmExfrIYHtuRJe_UYyN5XZgqR9ckp3hB5hIeRD7xp4uO1442F7lWLAXfpFiHc6TlF3skDFovSFgxrwf1kELMEOapgJ7hXQJkUYKEjfGI9cBYcMFFVuQzFOW5hU8LnHNHVPsHex3sanq42Jaj54eoiGhAy98OJgT38Q41VWdrfWWyQ-4WGw3U6A1Yue7OLAYYoh-L17_ipge_clT5_xInD8rMniyWLzNk6RJUDBej1TmOymz-1Iuwx7jh7KljguE8OFItBl1j1D59nbieFWm0Uil5qtGuwISFUX4gtFfVxcWe_1OJdDvd6JfL7PW5J1J8juOo6nXWGjp1-GAt6FjT7nDoojwmz6sivGQv3RzGxPAAUcc=w1279-h625-no"
        alt="STEP EMEA 2019 interns together ">
        <p><a href="https://vk.com/@ilonabozhe-step-internship-impressions">Эта статья VK.</a></p>
        <p><a href="https://telegra.ph/STEP-Internship-Impressions-08-05">Эта статья в Telegraph.</a></p>
        <p>P.S. Статья исправляется и дополняется по мере того, как я нахожу что-то полезное :) </p>
    </div>
</template>

<script>
    export default {
        name: "1"
    }
</script>

<style scoped>

</style>

