export default {
    posts: {
        1: {
            id: 1,
            title: "Сострадание & ответственность",
            text: "<p>Довольно часто случается, что при возникновении каких-то внешних или внутренних проблем нам нужна поддержка." +
                " Человек – существо социальное, так что это нормально." +
                "<br>Также довольно часто бывает, что из-за собственных проблем или общего неподходящего настроя нам не хочется давать эту " +
                "поддержку даже довольно близким людям, когда они просят. Человек – существо несовершенное, так что это также нормально.</p>" +
                "<p>Сострадание – чистая и бескорыстная эмоция, которая не может быть навязана. Следовательно, если кто-то, будь то общество с его моральными нормами или человек, пытается заставить нас сострадать, вряд ли из этого выйдет что-то хорошее.</p>" +
                "<br>Сострадание не может базироваться на чувствах обязательности или вины." +
                "<br>Если человек ощущает вину за то, что он не смог выдавить из себя сострадание, значит, он вступил в конфликт со своими внутренними этическими устоями и ему требуется поразмыслить о том, за что именно он испытывает вину и насколько это оправданно.</p>" +
                "<p>Всегда следует помнить о том, что простой человек не может контролировать все вокруг себя, особенно поведение других" +
                " людей. Нельзя причинить кому-то добро против его воли без грубого нарушения его свободы и личных границ. Первый шаг" +
                " всегда должен исходить от самого человека. Если этого импульса нет, то никакое сострадание от окружающих не поможет.</p>" +

                "<p>Нельзя изменить или исправить чью-то жизнь без желания, участия и содействия человека. Как и нельзя починить чью-то" +
                " жизнь, ломая свою – в результате будут два поломанных человека вместо двух целых.</p>" +
                "<p>Нельзя тащить кого-то к светлому будущему, можно только оказать поддержку во время пути.</p>",
            date: "2020-02-06",
            image: 'https://lh3.googleusercontent.com/8vbOIMmPZpDNrPZ2AJGxliNtLIo_g9gAsDIsp49hEd8D5cUNk8BroKB1DgVvTWAUsP53tJtDYYfO5uDdzDH1NFfRjpXORl-a4f79aGGx1zyVKKemBfUXuFc-thOld9ldvCeVfx1ZOFVrr77hLyvLKYG1DoVl3njrqZGFRhJP62U_GMkKu7Fciy3Pv_6g3upyksqLxZG8U4rU5HAzRCiate_SlcHoytGj4aF26Qzoi3k18aidFkNqmsTSuf2bgdfv8MGt7dotPfqT6ngXzfFBucdOhQIuwULlXc_kzif5_oHd70bdB9u46nPTN-5qbGsvs1-amxRu3vQDCtNe51t9JfS2GUmO_zZYy3lBMU7N_-EU8r84gTinMF80pNz6d09qcQHvAuzhCCEoc-ZvYy6I8-8EDcdmaIOeH7N2XAGhBZiW74YA7m1GAjCRPcyxP14-dxcdLf4UtjeGh377NunByhHPq2t-BQwgpMVrOuXG5fvMrG0kRQBR5AB_GYwtPUaJ5qyS-BK84G4p_IuE8jZZ72M-LBiIWwa0lqASCRrJXrNY8pOfeDFV8HRlpKx1ROJftVmi4oa24plG3GhFV0o0Lz10X59iNE-jacH3XThgZcNZCD6Dt7aHJgSL7hLHbixxZt1znq8dAlRQQcs2Ysd3uQrtntj4DbWJVvyCVGcmif-SMbs5PkJfyM8JrdYl_vcfEhmqnvLr9zmMNCaoalnT6S8tYb7t37CFE9_Vlh92i9NRP1MAx0v0wMY=w600-h338-no'
        },
        2: {
            id: 2,
            title: "Вынужденное одиночество",
            text: "        <p>Чаще всего мы даже не задумываемся о том, сколько людей нас окружают в повседневной жизни. Начиная с обширных дискуссий с однокурсниками или коллегами и заканчивая случайными диалогами с незнакомцами в кафе или на улице. Начиная с тусовок с друзьями в барах или антикафе и заканчивая дежурным \"Пакет нужен?\" от продавщицы в магазине. Всё это незримой сетью опутывает нас, делая высказывание \"Человек – существо социальное\" одним из самых правдивых в этом изменчивом мире.</p>\n" +
                "\n" +
                "        <p>Обычно мы этого не ощущаем, но сейчас настали необычные времена.</p>\n" +
                "\n" +
                "        <h3>***</h3>\n" +
                "        <p>Первые несколько дней в изоляции стали для меня самыми тяжёлыми именно потому, что большинство моих социальных связей внезапно оказались обрублены под корень. Я не могу назвать себя общительным человеком, более того, я довольно быстро устаю от людей, но в тот момент я почувствовала себя неуютно. Мысли, начинающие крутиться в этот момент в голове, питаются от паники и быстро навевают ощущение катастрофы. Пустота в мессенджерах вызывает тоску. \"На самом деле я никому не интересен\", \"Во мне никто не нуждается\", \"Я обречён жить в одиночестве\".</p>\n" +
                "\n" +
                "        <br>Скорее всего, мне не стали писать меньше, просто существенная часть того потока общения, которая подпитывала меня, шла от живых людей в offline, и это абсолютно нормально.\n" +
                "\n" +
                "        <p>Мысль №1. Парадоксально, но в эру соцсетей мы до сих пор не умеем или не желаем уметь полноценно общаться в интернете. Возможно, это субъективное наблюдение, но для меня реальность такова: сеть используется для наименее важной части общения, обсуждения мимолётных событий или конкретных задач, требующих разрешения. Для всего наиболее значимого, наиболее эмоционального, наиболее запоминающегося существуют встречи в реальности. Правильно ли это? На мой взгляд, да. Применимо ли это сейчас? Безусловно, нет.</p>\n" +
                "\n" +
                "        <br>Итак, то есть из-за изоляции я не просто лишилась существенной части общения с людьми, я лишилась наиболее значимой его части. Похоже, это объясняет панику.\n" +
                "\n" +
                "        <p>Мысль №2. Людям нужны запоминающиеся события, и именно сейчас мы учимся коннектить их с сетью. Трансляции спектаклей Большого Театра. Ланчи с друзьями в видеоконференциях. Спортивные марафоны с единомышленниками. Глупые челленджи в инстаграме. Это всё то, чем мы пытаемся замещать случайное живое общение, пропавшее из наших жизней: какие-то опыты на удивление удачные, какие-то ужасно плохи. Записавшись на спортивный марафон, я влилась в удивительное сообщество незнакомых мне, но очень классных душевных людей. По вечерам мы стоим с потрясающими ребятами в планке и разговариваем через zoom. Это то, чем сейчас наполняю свою жизнь я.</p>\n" +
                "\n" +
                "        <p>Мысль №3. Найти компанию стало сложнее, потому что ранее доступные способы теперь не работают. Нельзя сказать: \"Эй, кто в Теремок после пар?\", потому что пары онлайн, а все рестораны закрыты. Зато можно запостить в инстаграм или написать в какой-нибудь большой чатик: \"Эй, кому тоже скучно, давайте соберемся на чай в дискорде во столько-то, вот ссылка\". Может показаться глупым и навязчивым, но скорее всего, многие отзовутся.</p>\n" +
                "\n" +
                "        <h3>Итог</h3>\n" +
                "        <p>Мы все только учимся жить в этой новой удивительной цифровой реальности, и многим из нас немного страшно и одиноко. Но если люди начнут делать маленькие шажочки друг к другу, искать новые способы коммуникации и проявлять свойственную им изобретательность, то, возможно, этот непростой период обогатит нашу повседневную жизнь огромным количеством новых потрясающих деталей.</p>\n" +
                "    ",
            date: "2020-04-02",
            image: 'https://lh3.googleusercontent.com/ToXrV_ZfmxFXHvyzElQO6Bp1NiTFon8IfJoXdkEZxGo5gIve0LB5UDzQ4Hc-jh4jyIgbYurkVJx5VNTVcB7Znt9GAE9Yc3GK04N-fkD0zbvmhmwAHlDeeSpqX9KVA3R6LsgAz25GcIPdB2xnJVKXejKYSjm7Lh2pciQcUEpyQcc7S1k-yWRKtylpH-RglFb82vBlZviAyPRudFGEcf8cjazz1j_WPcsCq23Hzr13ROZMUzMKeNHU9hLpnV1uaXTvdEVHLODy5ytUZ22KE9RwgPFdkXQFnBQEXhP8mxqbqM3TXOiciCSh1GOHTmgiqcULYyhTTplYJqPwz-moZI916Orcz8LW7Zf64CSO4MHFbG11y0LQ4-5XpmVVOUN2vgQ-Y1RF-b6dUQLpFdB3vcB1iExMHC9CFbP7NafBPlb_4xwDVRq22R4Rl8ScdFGc8WnrJnxdFdxFGmwAwrR4lZsrk9Imk0eeeoUMSE9V0TuoWCGWb1yP1awD_qJ3anI5zQpn36I1foJMzNTrzZlgHPxH2izEiL9LoIMjBNF-gv-q6z8nuUFcbalBJiTR7Jvv1wJivrusglPeFFOZt4MV5SRySj-6YzBERJdOo0c5LbjBctom4AzjHA7v_v_zEDh-HZNGoTnvAIbnlA2mLS2KpthnbX3pSRqXxE-CM0d3nrQdGEb_SGY8cqCd5sbS60IIObNs1Pj5um_T3LrXD83jGmWhwEVeIkVLBoU5NML5jHhXXuclirFp2B8IJxY=w800-h450-no'
        },
        3: {
            id: 3,
            title: "Зона дискомфорта",
            text: "<p><i>- Простите, я в зоне комфорта недавно, ещё не толком не ориентируюсь, не подскажете, где здесь выход?</i></p>\n" +
                "\n" +
                "        <p>Меня всегда коробило от совета «выйти из зоны комфорта». Есть в этой фразе что-то противоестественное: на мой взгляд, стремление загнать себя в ситуацию, в которой тебе неуютно, а потом сидеть в ней, убеждая, что всё это неотъемлемая часть развития – это не самое здоровое поведение, больше похоже на самообман. Если модный блогер сказал, что это хорошо, значит, это хорошо, правда?</p>\n" +
                "\n" +
                "        <p>Рутина не всегда комфортна.\n" +
                "        <br>Новый опыт не всегда должен смущать.\n" +
                "            <br>Из зоны комфорта не нужно выходить – в ней нужно жить и её нужно расширять.</p>\n" +
                "\n" +
                "        <ul>\n" +
                "            <li><b>Расширить зону комфорта</b> – это найти новое хобби, подружиться с интересным человеком, съездить в путешествие, если это приносит радость.</li>\n" +
                "            <li><b>Выйти из зоны комфорта</b> – это занять должность, от которой тошнит, пойти на шумную тусовку, хотя хотелось провести вечер наедине с собой, сесть на жесткую изнуряющую диету, убедив себя, что так будет правильно. Едва ли в результате любого из этих решений жизнь станет лучше. Успешнее? Возможно. Но успех и качество жизни не всегда связаны.</li>\n" +
                "        </ul>\n" +
                "            \n" +
                "            <p>Принимая решение или собираясь что-то изменить в своей жизни, в первую очередь нужно понять, принесёт ли это пользу и положительные эмоции. Не с точки зрения абстрактного бизнес-тренера или чьей-то конкретной бабушки, в конце концов, с последствиями разбираться не им. При этом волноваться – это нормально, тратить все силы на работе – это нормально, жить в движении – это нормально, если это приносит удовлетворение и радость. Ненормально – это остро ощущать чужеродность своего существования и тосковать по уюту, которым могла бы быть наполнена жизнь.</p>\n" +
                "\n" +
                "        <p>Не нужно бежать из зоны комфорта, её нужно развивать и исследовать, <b>прислушиваясь к себе</b>.</p>",
            date: "2020-04-04",
            image: 'https://lh3.googleusercontent.com/rrMlhdRpLaYV7PG_7jZ84FczN64l0CfSytLRTqcUq0PgUOkUZI-2Q0YuYkKGWbQmbwQU0lwDyocVWxDW4em65Yx_o8xO_RPraNz4L8jee5cRuVq-aNX1Kk07yzTODdCkmWV6Rs4ggAFTC5gy8qHRoPQWSC3fWOI6O7Of4MbhaSlnIViMUDDIft7hfNN8iwFlYKzggX4pkRO2B2fMod9amBARS1Tva7qYF42QfvHO-GUQnfm_LA-bzQH1DsXKTe7QFkEXKdtJoCefKaeeG8v16Sh8ntQhdfNnjEcSKAGauNMcxCAov0E-JBVjrYn3YpNrAE1heEcgYF2EE-HjS7R4kux0ScYs9g5gPSF3gxg2j2XGHXGH1Kr4Ror-0GvG-bdRZdOK9zdWgkUzeMUSRfkE-iUAutAnFXniqV6WM2KzVj6tSCdWHK5JXIiGyTszf8tisL3kP7c8pi8My7VeVXWOdtYPLUVkoVCrPbSud-RtEk4--7aZd3PMs3K1N6CB-wRR7mSh5UVCRkr4Ei8rmwWh30MOm3MMz_-pNGgostE0S1uZJ19jR2l-woQDY5PfWeq-dcpMARkRBXu3l_nlaHf3HkSB85pfFmqGhuuMBmpovEo-fdqVvS4ac7zubwEaqVO9ymaidNDfq2s6gqBZ1mEuUFUMSxiBsuPyOwTOk8Q3hNbz4ZSdw3sHLViwhcZ4q3rJHYwGT0B2KUJKi8R0B1VAazZDykSvmVfzsig6sWzjh34w8UxwkdSkKGI=w1280-h720-no'
        },
        4: {
            id: 4,
            title: "Наедине с собой",
            text: "<p>Довольно часто мне встречаются люди, которые ни дня не могут прожить без компании, а оказавшись в одиночестве, впадают в состояние на грани между паникой и депрессией. Обычно это потрясающие ребята и даже странно, что такой пустяк способен выбить их из колеи. Можно свалить на банальную разницу между «интровертами» и «экстравертами», но это было бы слишком просто.</p>\n" +
                "\n" +
                "        <p>Есть один очевидный фактор: скука. Находясь в социуме, категорически сложно заскучать, потому что приходится постоянно реагировать на хаотические изменения в нашей жизни, совершаемые окружающими людьми. Примерно так с моей точки зрения выглядит общение: много слов, много взаимодействия, много новой информации. Голова постоянно занята обработкой внешнего шума, так что скукой тут явно и не пахнет.</p>\n" +
                "\n" +
                "        <p>Наедине с собой всё иначе. Внешние воздействия практически исчезают, и перед нами встаёт выбор: либо найти себе увлекательное занятие, способное вернуть мыслительный процесс в контролируемое русло, либо бездействовать и наслаждаться последствиями. Случиться может что угодно, от безобидного путешествия в мир грёз до деструктивного самокопания, в зависимости от того, как много подавленных эмоций и проблем заперто в глубинах памяти. И чем сложнее и насыщеннее жизнь, тем больше вероятность, что в момент тишины всплывут мысли и чувства, о которых мы и не догадывались.</p>\n" +
                "\n" +
                "        <p>Самый простой способ избежать этого - вернуть белый шум. В наше время самый легкодоступный источник этого шума - соцсети, раньше им было телевидение, а ещё раньше - лёгкое чтение. Все те занятия, которые не оставляют особого отпечатка, но предлагают мыслям ограниченную траекторию, по которой они могут двигаться. Не дают оказаться лицом к лицу с самим собой. Одна из самых нежеланных и страшных встреч, правда?</p>\n" +
                "\n" +
                "        <p>Но только рано или поздно внутренний дисбаланс проявит себя, в личности прорастут новые неожиданные черты, и сами того не замечая, мы станем незнакомцами, с которыми всегда боялись оставаться наедине. Временное одиночество - это не опасность, от которой нужно бежать, это возможность структурировать мысли и разобраться с чувствами. Нужно учиться анализировать себя и события, происходящие в жизни, нужно учиться делать выводы, нужно учиться думать не только по заданной траектории, но и на вольные темы. И тогда минуты одиночества станут не проклятием, а отдыхом, наполненным чувством небывалой свободы мысли и творчества.</p>\n" +
                "   ",
            date: "2020-04-07",
            image: 'https://lh3.googleusercontent.com/1j2jafpI-YbvY_AxC4Xpc3voQ6cFFYuhnLnNGB6s7CGRZIj3ezF0BAWWytJteq2kz8iO_lwKP2IZ0ynNN6maFLB__vDHqmLgwmN_Q-1N1QtANHOKfetHy47Oib4esqFH6XvrfozIgC3TeN2BH17u0mbT0eH3qOmB0AkasEZy2r_6qfKKKkP3-jmdMKyRejv3_vgGbtcqkvErWR9Egs61CkT5q_anmroyzQ96yAcRViwiaRkDPt_cqqIFelGhobiuQGW9a68rZtyDDEmqlHrRZd6RmQPetx3WL-THVPZXEPh_7e5GpYk-hER0wuIAgFPr1eAqqeh_f0fZ6b8zrziVMOzCSnDNHQF6pfZFBdir2_8-zdX4jfEJaKRFuRzgUeM9FRsLo0_5agayROvL5XyUMlFSGcgtBTQnmqtHPM7GCD3dZP2rLmrzf1IU4sA5FQ8gfcKWcFDvEhTU4DrxzjlwwXRK-bTCzFoQMmWLmR1M49jeRYWUHSS21E12PSHsBjRR_36HhzL-a8k23_e96-Ca_e_6ptnNLVSCqkvupqBihLFmheQuoe2UCTdUWUgXnMqfaE-2h2grHutPcGFsgFnF_2UQ5cstX7ZR3Watui9Hyk-dlrtIm6cs_iUl20RsHiqWD-1mWASREDpBNCgEE7ioIhtXdzfNs4TZMuBB-SNYJt2n2iqgK5-3Y-HXvOzUKvFEt5GxwjeeloY88sHqGwqj8lZh-H9kWFkZUdIU1CDCXC951tWfqysauYQ=w615-h345-no'
        },
        5: {
            id: 5,
            title: "Я гуляю одна",
            text: "<p>Для меня всегда отличным способом перезагрузки была долгая прогулка. И когда я говорю долгая - это значит она должна занимать действительно много времени, после неё должны болеть ноги, язык вываливаться на плечо, а сердечко недовольно стучать по рёбрам и спрашивать, мол, какого чёрта это я там устроила. Можно включить музыку в наушниках, можно наслаждаться шумом толпы: я обычно выбираю первое, потому что музыка здорово отвлекает мысли и всякая жесть капает в мозг дозировано. А перезагрузка мне нужна обычно именно тогда, когда всякой жести накопилось слишком много.</p>\n" +
                "\n" +
                "        <p>Не знаю, откуда это пристрастие, наверное, с детства. Когда я была совсем мелкой, мы ездили летом на уральские озёра и ходили вокруг них пешком. Не вокруг Кисегача, конечно, но Еловое я точно обошла раз десять. Потом все прибрежные зоны застроили (незаконно, наверное), и прогулки прекратились. Тогда они мне жутко не нравились, но сейчас, думаю, восьмичасовое путешествие вокруг уральского озера было бы лучшим впечатлением за последние месяцы.</p>\n" +
                "\n" +
                "        <p>По Питеру ходить тоже приятно. Он очень разный: если идти от острова к острову, то кажется, будто бродишь по огромному саду, и непонятно, где у него края. Если уйти в глубь центра, на каждом шагу будешь натыкаться на атмосферные закоулки и пафосные старые здания, дряхлеющие среди окружающей суеты. Несколько раз я потерялась на Петроградке: там меньше истории и больше мрачной индустриальности.</p>\n" +
                "\n" +
                "        <p>Каждая такая прогулка оставляет своё послевкусие: дождливо-серая ночная Петроградка колет щёки дождём, Марсово поле дымится июньской жарой и слепит глаза яркими солнечными лучами, Троицкий мост бесконечно тянется вдаль, ветер хлещет в лицо и мимо несутся машины, сверкая в темноте рыжими фарами. Однажды я несколько часов бродила вокруг Александринского театра и ела мороженое под звуки Лебединого озера в ушах.</p>\n" +
                "\n" +
                "        <p>В эти редкие моменты жизнь, обычно торопящаяся куда-то, делает передышку. Скучаю по своим прогулкам. </p>",
            date: "2020-04-14",
            image: 'https://lh3.googleusercontent.com/AtROoU8FMcfbv7CgBiX4TuhKGAAw_8d7WA1XuUOWb5qj2kSLZbcNC9EONRj8oG82ipB5566LqI9NPKZt39yWGqh9spkfkzJLDupkPJK1qBdKfRd7CQWcAwGA_HQ7ASzTm40j8RBN864ZRiVqZYkrubtg46XUlDWkAfK54RmTpXf5OlcOpPuMQ7_PPBHgSeFwrL5iMMwsn9CGaOZoIk5jJlYZXcviOCS7yU4xz74QA0C1Lp9BnxEoGEgZm3m23gDLst93PoqE2JJRgM6RV9qPGdJb6Ntrr883n_jCmIwoRGMhefpglfkhDXm-s1HFCORV-g4ZJ9vomSkHTZN01ZVPvck3wLBqBoAg_Eq7YekcGGgSFhh2Wa3mjOmNf7JKJu9V7X-W23tQfOSIk74kvZ3dUMkeDAJvyg4UkNRODyLimPefFSZPI9blbZmeG9bgzZKMaM-WRDwft4pkqm_1w5laP1AfVCNMVF5HK0y8k_ZlayQPGAp6UXwbp4yaRSeCeGqQeJ4zGt6BzqfEZq96Ir55pD7E-6KFUEUXT93yt6RdBg2MXPlIw7L1FcIATLIDBkzP2HoG5IuEfQIj8lGRYp1HPnQ__dEanq30TIF5kFEFkaV_pu6RwwsHfsI0J78mmseMbji0eG3GKLchs51ggL4DB4xHwXl4M1y9zBwco1MtFdrZhAAIb4i9SMhXfQfr4IV2gKWXSFb-YJUcIbWZLtYmgPQ-DvIdfN34CUrwFtmMH3T4XmsXD3Vd0aA=w1280-h721-no'
        }
    }
}
